<template>
  <table class="mt-6 w-full">
    <thead>
      <tr class="text-left">
        <th class="border-color-ui border-b-2 pr-2">Дата</th>
        <th class="border-color-ui border-l-2 border-b-2 pl-2 py-2">
          Заголовок
        </th>
      </tr>
    </thead>
    <tbody>
      <tr v-for="article in articles" :key="article.id">
        <td class="pr-4">
          {{ moment(article?.created_at).format("DD.MM.Y") }}
        </td>
        <td class="py-2 w-full">
          <div class="flex items-center gap-x-2">
            <div class="grow">{{ article?.title }}</div>
            <NuxtLink
              :to="
                ROUTES_NAMES.clinic_profile_clinics_articles_edit(
                  +$route.params.id,
                  article.id
                )
              "
            >
              <svg
                width="15"
                height="15"
                viewBox="0 0 15 15"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_213_1731)">
                  <path
                    d="M14.3111 0.68947C13.8853 0.264388 13.3083 0.0256348 12.7067 0.0256348C12.1051 0.0256348 11.528 0.264388 11.1023 0.68947L0.917426 10.8744C0.625763 11.1644 0.394506 11.5094 0.237034 11.8893C0.079561 12.2693 -0.00100069 12.6767 9.38158e-06 13.0881V14.3737C9.38158e-06 14.5398 0.0659862 14.6991 0.183426 14.8165C0.300865 14.9339 0.460148 14.9999 0.626232 14.9999H1.91187C2.32315 15.0011 2.73057 14.9206 3.11055 14.7633C3.49054 14.6059 3.83553 14.3747 4.12556 14.0831L14.3111 3.89761C14.736 3.4719 14.9746 2.895 14.9746 2.29354C14.9746 1.69207 14.736 1.11518 14.3111 0.68947ZM3.24009 13.1976C2.8869 13.5485 2.40969 13.746 1.91187 13.7475H1.25245V13.0881C1.25182 12.8413 1.30015 12.5968 1.39463 12.3688C1.48912 12.1408 1.62788 11.9338 1.8029 11.7598L9.53237 4.03037L10.9727 5.47068L3.24009 13.1976ZM13.425 3.01213L11.8557 4.58207L10.4153 3.14489L11.9853 1.57495C12.0799 1.48058 12.1921 1.40577 12.3156 1.35477C12.4391 1.30378 12.5714 1.27761 12.705 1.27776C12.8386 1.2779 12.9708 1.30436 13.0942 1.35562C13.2176 1.40688 13.3297 1.48194 13.424 1.57651C13.5184 1.67109 13.5932 1.78332 13.6442 1.90681C13.6952 2.03029 13.7214 2.16261 13.7212 2.29621C13.7211 2.42981 13.6946 2.56207 13.6434 2.68545C13.5921 2.80882 13.517 2.92089 13.4225 3.01526L13.425 3.01213Z"
                    fill="#046EBE"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_213_1731">
                    <rect width="15" height="15" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </NuxtLink>
            <button @click="(deleteId = article.id), open()" class="flex">
              <svg
                width="15"
                height="15"
                viewBox="0 0 15 15"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_213_1733)">
                  <path
                    d="M13.125 2.5H11.1875C11.0424 1.79463 10.6586 1.16084 10.1008 0.705449C9.54293 0.250056 8.84513 0.000909078 8.125 0L6.875 0C6.15487 0.000909078 5.45707 0.250056 4.89922 0.705449C4.34136 1.16084 3.95756 1.79463 3.8125 2.5H1.875C1.70924 2.5 1.55027 2.56585 1.43306 2.68306C1.31585 2.80027 1.25 2.95924 1.25 3.125C1.25 3.29076 1.31585 3.44973 1.43306 3.56694C1.55027 3.68415 1.70924 3.75 1.875 3.75H2.5V11.875C2.50099 12.7035 2.83055 13.4978 3.41639 14.0836C4.00222 14.6694 4.7965 14.999 5.625 15H9.375C10.2035 14.999 10.9978 14.6694 11.5836 14.0836C12.1695 13.4978 12.499 12.7035 12.5 11.875V3.75H13.125C13.2908 3.75 13.4497 3.68415 13.5669 3.56694C13.6842 3.44973 13.75 3.29076 13.75 3.125C13.75 2.95924 13.6842 2.80027 13.5669 2.68306C13.4497 2.56585 13.2908 2.5 13.125 2.5ZM6.875 1.25H8.125C8.51267 1.25047 8.89071 1.37086 9.20726 1.59465C9.52381 1.81844 9.76339 2.13468 9.89313 2.5H5.10688C5.23661 2.13468 5.47619 1.81844 5.79274 1.59465C6.1093 1.37086 6.48733 1.25047 6.875 1.25ZM11.25 11.875C11.25 12.3723 11.0525 12.8492 10.7008 13.2008C10.3492 13.5525 9.87228 13.75 9.375 13.75H5.625C5.12772 13.75 4.65081 13.5525 4.29918 13.2008C3.94754 12.8492 3.75 12.3723 3.75 11.875V3.75H11.25V11.875Z"
                    fill="#046EBE"
                  />
                  <path
                    d="M6.25 11.25C6.41576 11.25 6.57473 11.1842 6.69194 11.0669C6.80915 10.9497 6.875 10.7908 6.875 10.625V6.875C6.875 6.70924 6.80915 6.55027 6.69194 6.43306C6.57473 6.31585 6.41576 6.25 6.25 6.25C6.08424 6.25 5.92527 6.31585 5.80806 6.43306C5.69085 6.55027 5.625 6.70924 5.625 6.875V10.625C5.625 10.7908 5.69085 10.9497 5.80806 11.0669C5.92527 11.1842 6.08424 11.25 6.25 11.25Z"
                    fill="#046EBE"
                  />
                  <path
                    d="M8.75 11.25C8.91576 11.25 9.07473 11.1842 9.19194 11.0669C9.30915 10.9497 9.375 10.7908 9.375 10.625V6.875C9.375 6.70924 9.30915 6.55027 9.19194 6.43306C9.07473 6.31585 8.91576 6.25 8.75 6.25C8.58424 6.25 8.42527 6.31585 8.30806 6.43306C8.19085 6.55027 8.125 6.70924 8.125 6.875V10.625C8.125 10.7908 8.19085 10.9497 8.30806 11.0669C8.42527 11.1842 8.58424 11.25 8.75 11.25Z"
                    fill="#046EBE"
                  />
                </g>
                <defs>
                  <clipPath id="clip0_213_1733">
                    <rect width="15" height="15" fill="white" />
                  </clipPath>
                </defs>
              </svg>
            </button>
          </div>
        </td>
      </tr>
    </tbody>
  </table>

  <LazyUiModal :name="nameModalConfirmDelete">
    <UiModalInner class="py-16 px-4">
      <div class="">
        <p class="font-medium text-lg text-center mb-4">
          Вы дейстивтельно хотите удалить статью?
        </p>
        <div class="flex gap-x-2">
          <UiButton @click="deleteConfirm" bgColor="red">Удалить</UiButton>
          <UiButton @click="deleteCancel">Отмена</UiButton>
        </div>
      </div>
    </UiModalInner>
  </LazyUiModal>
</template>

<script lang="ts" setup>
import moment from "moment";
import type IArticle from "~/interfaces/models/Article";

interface IProps {
  articles?: IArticle[] | [];
  getArticles: Function;
}

const props = defineProps<IProps>();

const nameModalConfirmDelete = "confirm-delete-article";
const { open, close } = useModal({ name: nameModalConfirmDelete });

const { deleteId, deleteCancel, deleteConfirm } = useDeleteConfirm({
  apiName: "articles",
  get: props.getArticles,
  close,
});
</script>
