<template>
  <div class="container">
    <div class="profile shadow-md p-3">
      <ProfileTop />
      <div class="text-sm mb-4">
        <p>
          Приглашение сотрудников (выдача прав) для работы с системой ПроКлинику
        </p>
        <p>
          В разделе Настройки -> сотрудники выберите -> Пригласить сотрудника.
        </p>
        <p>
          Введите почту и ФИО сотрудника, также укажите роль этого человека
          (Руководитель, Специалист) нажмите кнопку отправить, человек получит
          СМС и ему станет доступно административное меню в Панели управления
          ЛПУ.
        </p>
        <p>
          Для получения доступа ко всем возможностям сервиса ПроКлинику,
          пополните лицевой счёт выписав Счёт на оплату в разделе Счета и
          активировав Премиум аккаунт в разделе Услуги.
        </p>
        <p>
          Сервис ПроКлинику предлагает максимально удобный и безопасный доступ к
          функционалу, зарегистрирован в Едином Реестре российского ПО под №
          20472
        </p>
        <p>
          В случае вопросов можно ознакомиться с разделом Помощи, обратиться с
          вопросом в Техподдержку (для зарегистрированных клиник), в чат
          телеграмм канала ПроКлинику или на почту
          <a href="mailto:support@procliniku">support@procliniku</a>.
        </p>
        <!-- <h3 class="font-medium mb-1">Добавление клиники</h3>
        <ol class="list-decimal pl-4">
          <li>
            Добавьте юридическое лицо в систему с помощью вашего ключа ЭЦП.
          </li>
          <li>
            У нового юридического лица нажмите кнопку - "Добавить клинику"
          </li>
          <li>Система найдет действующие лицензии в базе Росздравнадзора</li>
          <li>По данным лицензии система подберет клиник из базы сайта</li>
          <li>Установите связи</li>
        </ol> -->
      </div>
      <div class="flex gap-x-2 items-center justify-between">
        <div class="">
          <UiButton class="px-3" @click="$router.back()">Назад</UiButton>
        </div>
        <a class="" href="https://procliniku.ru/" target="_blank" external>
          <UiButton class="px-3">Перейти на сайт</UiButton>
        </a>
      </div>
    </div>
  </div>
</template>

<script lang="ts" setup>
useSeoMeta({
  title: "Помощь",
});

definePageMeta({
  middleware: ["auth"],
});
</script>

<style lang="scss" scoped>
.profile {
  border-radius: 10px;

  &__top {
    border-bottom: 1px solid var(--ui-color);
  }
}
</style>
