<template>
  <div class="container">
    <h1 class="font-medium text-ui-2 mb-3">О сервисе</h1>
    <p class="mb-4">
      Сервис «ПроКлинику» собрал информацию о всех лечебных учреждениях России,
      чтобы помочь пациентам найти нужное заведение.
    </p>

    <h2 class="font-medium text-ui-2 mb-3">Что может сервис «ПроКлинику»?</h2>
    <ul class="mb-2">
      <li>
        Найти все учреждения вашего города, предлагающие необходимые процедуры,
        и помочь выбрать удобное
      </li>
      <li>Сравнить графики работы и цены в разных лечебных учреждениях</li>
      <li>Показать рейтинг учреждения</li>
      <li>Записать на прием онлайн и отправить смс-напоминание о визите *</li>
      <li>
        Помочь обратиться за дополнительной информацией по интересующим вопросам
      </li>
      <li>Предоставить документы для возврата налога *</li>
    </ul>
    <p class="mb-2">
      Предусмотрена возможность получения сведений о клиниках любого российского
      города (более 1600 населённых пунктах всей России). Важное замечание для
      пользователей проекта: все клиники проходят регистрацию с помощью ЭЦП и
      выданной на это юридическое лицо лицензии. Блаагодаря этому в базе не
      присутствуют не имеющие медицинской лицензии учреждения.
    </p>
    <p class="mb-2">
      Простой и понятный функционал позволяет быстро ориентироваться на сайте и
      достигать результата поиска. Специальные фильтры быстро группируют
      медицинские учреждения по направлениям деятельности и наиболее
      востребованным медицинским процедурам, видам лечения и диагностики.
    </p>
  </div>
</template>

<script lang="ts" setup>
const title = `О нас`;
const description = "Поможем вам найти подходящую - клинику именно для вас";
useSeoMeta({
  title,
  ogTitle: title,
  description,
  ogDescription: description,
});
</script>
