<template>
  <div class="px-8">
    <h1 class="font-medium text-ui-2 mb-3">ДОГОВОР-ОФЕРТА С ФИЗ. ЛИЦОМ</h1>
    <p class="mb-2">
      Настоящее Соглашение заключается между ООО «ЭНВД» (далее – Владелец) и
      любым лицом, становящимся после принятия условий данного соглашения
      пользователем сайта «ПроКлинику», расположенного в сети Интернет по
      адресу: <a :href="requestUrl.origin">{{ requestUrl.origin }}</a> (далее –
      Сайт), в дальнейшем именуемым «Пользователь», вместе по тексту Соглашения
      именуемые «Стороны», а по отдельности – «Сторона».
    </p>
    <p class="mb-2">
      В соответствии со статьей 435 Гражданского кодекса РФ настоящее
      Пользовательское соглашение признается офертой.
    </p>
    <p class="mb-2">
      В соответствии со статьей 438 Гражданского кодекса РФ безусловным
      принятием (акцептом) условий настоящего Соглашения считается факт доступа
      Пользователя к любой странице на Сайте.
    </p>
    <p class="mb-6">
      Настоящее Соглашение, заключаемое путем акцепта настоящей оферты, не
      требует двустороннего подписания и действительно в электронном виде.
    </p>

    <h2 class="font-medium mb-2">
      1. Термины и определения, используемые в Соглашении
    </h2>
    <div class="mb-6">
      В Соглашении, если из текста Соглашения прямо не вытекает иное, следующие
      слова и выражения будут иметь указанные ниже значения:
      <br />
      1.1. Сайт – совокупность программных и аппаратных средств для ЭВМ,
      интернет сервисов, обеспечивающих публикацию для всеобщего обозрения
      информации и данных, объединенных общим целевым назначением, посредством
      технических средств, применяемых для связи между ЭВМ в сети Интернет. Сайт
      находится в сети Интернет по адресу:
      <a :href="requestUrl.origin">{{ requestUrl.origin }}</a
      >.
      <br />
      1.2. Администратор/Владелец Сайта – общество с ограниченной
      ответственностью «ЭНВД», расположенное по адресу: 450077, г. Уфа, ул.
      Цюрупы, дом 40. 1.3. Контентом Сайта признаются все объекты, размещенные
      на Сайте, в том числе элементы дизайна, текст, графические изображения,
      иллюстрации, видео, скрипты, программы, музыка, звуки и другие объекты и
      их подборки. Владелец Сайта является обладателем исключительных прав на
      использование Сайта, включая весь контент Сайта.
      <br />
      1.4. Пользователь – пользователь сети Интернет , в частности Сайта, –
      физическое лицо или представитель юридического лица имеющий свою личную
      страницу (профиль/аккаунт) на Сайте.
      <br />
      1.5. Профиль/аккаунт (Профиль) – личная страница Пользователя на Сайте,
      доступная всем Пользователям Сайта.
      <br />
      1.6. Учетная информация – уникальное имя Пользователя (логин) и пароль для
      входа на Сайт, указываемые Пользователем при регистрации на Сайте.
      <br />
      1.7. Модерация – просмотр Владельцем Сайта размещаемой (или планируемой к
      размещению – Премодерация) на Сайте Пользователем информации на предмет ее
      соответствия положениям настоящего Соглашения и требованиям
      законодательства.
      <br />
      1.7. Электронная Подпись (далее ЭП) – Квалифицированная Электронная
      Подпись выданная удостоверяющим центром из сети доверенных УЦ Минцифры
      России. Применяется для подтверждения полномочий представителя ЮЛ.
      <br />
      1.8. Лечебно-Профилактическое учреждение (далее ЛПУ) - медицинское
      учреждение, предназначенное для оказания лечебно‑профилактической помощи
      населению.
    </div>

    <h2 class="font-medium mb-2">2. Предмет Соглашения</h2>
    <div class="mb-6">
      2.1. Владелец сайта предоставляет право доступа к информационной системе
      сайта ПроКлинику являющуюся совокупностью программ для ЭВМ на основе
      простой не исключительной лицензии.
      <br />
      2.2. Владелец Сайта предоставляет Пользователю право доступа к сервисам
      Сайта, при этом обязательным условием предоставления доступа в
      соответствии с настоящим Соглашением является принятие в полном объеме и
      соблюдение Пользователем условий настоящего Соглашения.
      <br />
      2.3. Владелец Сайта вправе в любое время в одностороннем порядке изменять
      условия настоящего ПС без какого-либо специального уведомления. Такие
      изменения вступают в силу с момента размещения новой версии ПС на сайте.
      При несогласии Пользователя с внесенными изменениями он обязан немедленно
      отказаться от доступа к Сайту, а равно прекратить использование любых
      материалов и сервисов Сайта.. Новая редакция Соглашения и/или какой-либо
      его неотъемлемой части вступает в силу с момента опубликования на Сайте,
      если иной срок вступления изменений в силу не определен Владельцем Сайта
      при их опубликовании. Действующая редакция Соглашения и всех приложений к
      нему всегда находится на Сайте в публичном доступе по адресу:
      <a :href="requestUrl.href">{{ requestUrl.href }}</a
      >.
    </div>

    <h2 class="font-medium mb-2">3. Права и обязанности Владельца Сайта</h2>

    <h3 class="font-medium mb-2">3.1. Владелец Сайта обязуется:</h3>
    <div class="mb-2">
      3.1.1. В случае наличия сомнений относительно правомерности использования
      Сайта Пользователем, Владелец Сайта вправе в любое время и без
      предварительного уведомления Пользователя по своему усмотрению удалить или
      блокировать его учетные записи.
      <br />
      3.1.2. Если Владельцу Сайта станет известно об использовании Учетной
      записи Пользователя другими Пользователями или какими-либо третьими
      лицами, Владелец сайта  вправе в любое время и без предварительного
      уведомления Пользователя удалить или блокировать такую учетную запись.
      <br />
      3.1.3. Владелец Сайта вправе в любое время, без какого-либо
      предварительного уведомления или компенсации блокировать использование
      Учетной информации любому Пользователю, если он нарушает настоящее
      Пользовательское Соглашение.
      <br />
      3.1.4. В случае расторжения (прекращения) договора с Пользователем, или
      отсутствия какого-либо заключенного договора с Пользователем Владелец
      Сайта вправе в любое время без предупреждения и согласования с
      Пользователем, а также без какой-либо компенсации и объяснения причин
      удалить регистрацию и всю его Учетную информацию на Сайте.
      <br />
      3.1.5. Предоставлять Пользователю возможность самостоятельно публиковать
      информацию о своем ЛПУ, статьи и иные материалы по тематике Сайта.
      <br />
      3.1.6. Не разглашать третьим лицам Учетную информацию Пользователя.
      <br />
      3.1.7. Обеспечивать круглосуточную доступность сервера, на котором
      расположен Сайт, за исключением времени проведения профилактических работ.
    </div>

    <h3 class="font-medium mb-2">3.2. Владелец Сайта имеет право:</h3>
    <div class="mb-6">
      3.2.2. Осуществлять Модерацию в любых случаях и на свое усмотрение в том
      числе , когда информация, размещаемая Пользователем, пропагандирует
      ненависть и/или дискриминацию людей по расовому, этническому, половому,
      религиозному, социальному признакам; пропагандирует употребление
      наркотических и прочих средств, наносящих вред здоровью; призывает к
      бесчеловечному обращению с животными; содержит призывы к насильственным
      действиям; нарушает права авторов и иных владельцев интеллектуальных прав.
      <br />
      3.2.3. Распоряжаться статистической информацией, связанной с
      функционированием Сайта, а также информацией Пользователей для обеспечения
      адресного показа рекламной информации различным аудиториям Пользователей
      Сайта.
      <br />
      3.2.4. Направлять Пользователю информацию о развитии Сайта и его сервисов;
      отправлять sms-сообщения с целью информирования о кодах активации,
      проведения опросов о качестве работы Сайта, предоставления и запросов
      прочей информации, а также рекламировать собственную деятельность и
      услуги.
    </div>

    <h2 class="font-medium mb-2">4. Обязательства Пользователя</h2>
    <div class="mb-2">
      Для того, чтобы воспользоваться некоторыми Сервисами Сайта, Вы
      соглашаетесь предоставить правдивую, точную и полную информацию о себе по
      вопросам, предлагаемым в Форме Регистрации, и поддерживать эту информацию
      в актуальном состоянии. Если Вы предоставляете неверную информацию, Сайт
      имеет право приостановить либо отменить Вашу регистрацию и отказать Вам в
      использовании своих Сервисов.
      <br />
      Используя Сайт, Пользователь обязуется не совершать следующих действий:
      <br />
      Любым способом посредством Сайта размещать, распространять, сохранять,
      загружать и/илиуничтожать материалы (информацию) в нарушение
      законодательства РФ и международного законодательства.
      <br />
      Размещать и/или передавать посредством Сайта информацию в виде текста,
      изображения, видео, звука или программного кода, которая может быть
      противозаконной, угрожающей, оскорбительной, клеветнической, заведомо
      ложной, грубой, непристойной, вредить другим посетителям Сайта, нарушать
      их права.
      <br />
      Представляться чужим именем или от чужого имени (частного лица или
      организации) - зарегистрированного на Сайте врача, представителя клиники,
      другого Пользователя Сайта, сотрудника Администрации Сайта. Вводить в
      заблуждение пользователей и Администрацию Сайта относительно своей
      идентификации любым иным способом.
      <br />
      Размещать заведомо недостоверную информацию о себе или своей компании.
      <br />
      Размещать и/или передавать, используя Сайт, контент (включая, но не
      ограничивая: информацию, материалы, файлы и т.п.) в случае, если
      Пользователь не имеет на это необходимого объема прав. Это касается любого
      контента, содержащего какие-либо произведения, товарные знаки и знаки
      обслуживания, фирменные наименования, патентную и конфиденциальную
      информацию, информацию, составляющую чью-либо коммерческую тайну, иные
      охраняемые результаты интеллектуальной деятельности, и тому подобное.
      <br />
      Уничтожать и/или изменять любые материалы на Сайте, автором или
      правообладателем которых Пользователь не является.
      <br />
      Использовать персональную информацию пользователей Сайта для целей иных,
      нежели рассмотрение и/или оценка их профессиональных качеств, а равно
      осуществлять сбор персональных данных других Пользователей с целью их
      последующей обработки, то есть совершения действий (операций) с
      персональными данными, включая их сбор, систематизацию, накопление,
      распространение и уничтожение.
      <br />
      Использовать информацию о телефонах, почтовых адресах, адресах электронной
      почты для целей иных, нежели тематика Сайта (вопросы организации
      медицинской помощи, выбор лечащего врача и тому подобное).
      <br />
      Рекламировать ресурсы сети интернет предлагающих аналогичные сервисы для
      физических и юридическим лиц.
      <br />
      Размещать на странице Пользователя (как физического, так и юридического
      лица) любую контактную информацию, включая, но не ограничиваясь, номер
      телефона, адрес электронной почты, доменное имя сайта не относящуюся к ЛПУ
      или Врачах зарегистрированных Пользователем.
      <br />
      Использовать Сервисы Сайта для публикации, распространения, хранения,
      передачи в любой форме информации, материалов, данных, которые не
      соответствующую Политике публикации материалов на Сайте.
      <br />
      Пользователь, предоставляя Администрации Сайта информацию/материалы к
      размещению на Сайте, либо размещая информацию/материалы на сайте
      самостоятельно, в случае наличия такой технической возможности,
      гарантирует соблюдение им требований действующего законодательства РФ,
      включая Федеральный закон от 13.03.2006 N 38-ФЗ «О рекламе». В случае
      привлечения Администрации Сайта к ответственности за нарушение
      действующего законодательства РФ (включая Федеральный закон от 13.03.2006
      N 38-ФЗ «О рекламе») в связи с размещением Пользователем
      информации/материалов на Сайте или размещением Администрацией Сайта
      информации/материалов на Сайте, предоставленных ему Пользователем,
      Пользователь возмещает Администрации Сайта все возможные понесенные им
      расходы, включая, но не ограничивая: штрафы, судебные расходы и прочее, в
      течение 10 календарных дней с момента предъявления соответствующего
      требования Администрацией Сайта в адрес Пользователя.
      <br />
      Пользователь принимает положение о том, что все материалы и сервисы Сайта
      или любая их часть могут сопровождаться рекламой.
    </div>
    <div class="mb-2">
      В целях реализации настоящего Соглашения Пользователи дают Владельцу Сайта
      разрешение на использование, хранение, обработку и распространение
      персональных данных тем способом и в той мере, в которой это необходимо
      для исполнения условий настоящего Соглашения. Порядок использования,
      хранения, обработки и распространения персональных данных Пользователей
      размещен на Сайте по адресу:
      <a :href="requestUrl.origin + ROUTES_NAMES.policy">{{
        requestUrl.origin + ROUTES_NAMES.policy
      }}</a
      >. Пользователь соглашается на передачу третьим лицам персональных и иных
      данных, в том числе для целей их обработки, для обеспечения
      функционирования Сайта, реализации партнерских и иных программ, при
      условии обеспечения в отношении передаваемых данных режима, аналогичного
      режиму, существующему на Сайте, в том числе включая, но не ограничиваясь,
      передачу персональных данных третьим лицам в случаях, когда такая передача
      необходима для использования Пользователем определенного сервиса либо для
      исполнения определенного соглашения или договора с Пользователем.
      Обработка персональных данных осуществляется в соответствии с политикой по
      обработке персональных данных ООО «ЭНВД».
    </div>
    <div class="mb-2">
      Настоящим Пользователь выражает свое согласие на получение от Владельца
      Сайта (в любое время и без предварительного предупреждения) по адресу
      электронной почты и/или на телефонный номер, указанные Пользователем при
      регистрации на Сайте, информационных сообщений, а также иную информацию,
      включая рекламу.
    </div>
    <div class="mb-2">
      В целях пользования услугами, предоставляемыми Владельцем Сайта по
      настоящему Соглашению, Пользователь должен пройти обязательную процедуру
      регистрации на Сайте по адресу
      <a :href="requestUrl.origin + ROUTES_NAMES.register">{{
        requestUrl.origin + ROUTES_NAMES.register
      }}</a
      >. Регистрация Пользователя на Сайте является бесплатной, добровольной.
    </div>
    <div class="mb-2">
      При регистрации на Сайте Пользователь обязан предоставить Владельцу Сайта
      необходимую достоверную и актуальную информацию для формирования Профиля,
      включая уникальные для каждого Пользователя логин (адрес электронной
      почты) и пароль доступа к Сайту, а также фамилию и имя. Регистрационная
      форма Сайта может запрашивать у Пользователя дополнительную информацию.
    </div>
    <div class="mb-2">
      Для начала работы с Сайтом Пользователь должен ввести в соответствующем
      разделе Сайта свою Учетную информацию.
    </div>
    <div class="mb-6">
      Если Пользователем не доказано обратное, любые действия, совершенные с
      использованием его логина и пароля, считаются совершенными соответствующим
      Пользователем. В случае несанкционированного доступа к логину и паролю
      и/или Профилю Пользователя или распространения логина и пароля
      Пользователь обязан незамедлительно сообщить об этом Владельцу Сайта в
      установленном порядке.
    </div>

    <h2 class="font-medium mb-2">5. Использование материалов Пользователя</h2>
    <div class="mb-6">
      5.1. Пользователь соглашается, что любые опубликованные на Сайте материалы
      будут общедоступны сколь угодно долго, смогут индексироваться различными
      поисковыми системами, могут быть использованы всеми другими
      Пользователями, а равно и Сайтом, без выплаты пользователю каких-либо
      вознаграждений и без дополнительного разрешения. Также Пользователь
      согласен с тем, что удаление материалов после их публикации запрещено.
      <br />
      5.2. Пользователь дает согласие на включение его персональных данных в
      базу данных Сайта. Пользователь соглашается, что Сайт оставляет за собой
      право использовать его персональные данные анонимно и в обобщенном виде
      для статистических целей.
      <br />
      5.3. Сайт вправе раскрывать Персональные данные Пользователя по запросам
      правоохранительных органов, решению суда и в прочих случаях,
      предусмотренных законодательством РФ.
      <br />
      5.4. Зарегистрированный Пользователь имеет право в любое время удалить
      свои персональные данные. После удаления Пользователем своих персональных
      данных опубликованные им материалы определяются как анонимные.
    </div>

    <h2 class="font-medium mb-2">
      6. Ограниченная гарантия на использование Сайта
    </h2>
    <div class="mb-6">
      6.1. Владелец Сайта не гарантирует, что программное обеспечение Сайта не
      содержит ошибок и/или компьютерных вирусов, или посторонних фрагментов
      кода. Пользователю предоставляется возможность пользоваться программным
      обеспечением Сайта «как есть», без каких-либо гарантий со стороны
      Владельца Сайта.
      <br />
      6.2. Владелец Сайта и его работники ни при каких обстоятельствах не
      оказывают Пользователю медицинских услуг, платных или бесплатных, в том
      числе в форме консультирования, не дают советов о диагностике и лечении
      заболеваний, а также приеме лекарственных средств.
      <br />
      6.3. Информация о медицинских услугах, болезнях, специализации врачей
      носит справочный характер. Владелец  Сайта не гарантирует ее достоверность
      и соответствие современным научным достижениям. Владелец Сайта
      настоятельно рекомендует обращаться за квалифицированной медицинской
      помощью непосредственно к врачам требуемой специализации, в том числе к
      тем, профили которых представлены на Сайте.
      <br />
      6.4. Поскольку идентификация пользователей и посетителей Сайта затруднена
      по техническим причинам, Владелец Сайта не отвечает за то, что
      зарегистрированные пользователи являются действительно теми лицами, за
      которых себя выдают, и не несет ответственности за возможный ущерб,
      причиненный пользователям Сайта или другим лицам по этой причине.
      <br />
      6.5.Если использование Пользователем Сайта повлекло за собой утрату данных
      или порчу оборудования, Владелец Сайта не несет за это ответственности.
      <br />
      6.6. Пользователь соглашается с тем, что Владелец Сайта не несет никакой
      ответственности за возможные перебои в предоставлении сервисов Сайта, а
      также за сохранность материалов Пользователя.
      <br />
      6.7. Владелец Сайта не несет ответственности за любые прямые или непрямые
      убытки, произошедшие из-за использования либо невозможности использования
      Сайта, несанкционированного доступа к Вашим коммуникациям. 6.8. Владелец
      Сайта не несет ответственности за использование (правомерное и
      неправомерное) материалов, размещенных Пользователем на Сервисах Сайта,
      включая их копирование, тиражирование и распространение, осуществляемое
      как в рамках Сайта, так и иными возможными способами.
    </div>

    <h2 class="font-medium mb-2">7. Финансовые отношения</h2>
    <div class="mb-6">
      7.1. В связи с тем, что по настоящему ПС Пользователю не предоставляется
      никаких платных услуг, на отношения между Владельцем Сайта и
      Пользователями не распространяется Федеральный закон «О защите прав
      потребителей».
      <br />
      7.2. Платные сервисы Сайта и Услуги, оказываемые Владельцем Сайта,
      регулируются отдельным договором-офертой, опубликованной на Сайте, или
      иными договорами, в случае их заключения между Администрацией Сайта и
      Пользователем.
      <br />
      7.3. Владелец Сайта не является представителем врачей, лечебных
      учреждений, а также физических лиц, обращающихся к ним за медицинской
      помощью, поэтому не может отвечать ни за какие финансовые обязательства,
      возникающие между теми и другими. Любые договоренности между
      вышеуказанными лицами, использующими Сайт, являются двусторонними, и
      Владелец Сайта не имеет к ним отношения.
    </div>

    <h2 class="font-medium mb-2">8. Ответственность Сторон</h2>
    <div class="">
      8.1. Пользователь самостоятельно определяет перечень организационных и
      программных (для ЭВМ) средств для сохранения в тайне своей Учетной
      информации и обеспечения санкционированного доступа к ней. Владелец Сайта
      не несет ответственность за убытки, причиненные Пользователю в результате
      разглашения третьим лицам Учетной информации Пользователя, произошедшего
      не по вине Владельца Сайта. Если любое лицо, помимо Пользователя,
      авторизуется на Сайте, используя Учетную информацию Пользователя, то все
      действия, совершенные таким лицом, будут считаться совершенными этим
      Пользователем. Пользователь самостоятельно несет ответственность за все
      действия, совершенные им на Сайте, а также за все действия, совершенные на
      Сайте любыми иными лицами с использованием Учетной информации
      Пользователя.
      <br />
      8.2. Владелец Сайта не гарантирует, что программное обеспечение Сайта не
      содержит ошибок и/или компьютерных вирусов или посторонних фрагментов
      кода. Владелец Сайта предоставляет возможность Пользователю пользоваться
      программным обеспечением Сайта «как оно есть», без каких-либо гарантий со
      стороны Владельца Сайта.
      <br />
      8.3. Владелец Сайта не несет ответственности за убытки, причиненные
      Пользователю в результате сообщения другим Пользователем недостоверной
      информации, а также причиненные действиями (бездействием) другого
      Пользователя. Владелец Сайта не гарантирует, что информация, содержащаяся
      в Профилях Пользователей, является достоверной и полной.
      <br />
      8.4. Владелец Сайта прилагает все возможные усилия для обеспечения
      нормальной работоспособности Сайта, однако не несет ответственности за
      неисполнение или ненадлежащее исполнение обязательств по Соглашению, а
      также возможные убытки, возникшие в том числе, но не ограничиваясь, в
      результате
    </div>
  </div>
</template>

<script lang="ts" setup>
const requestUrl = useRequestURL();

const title = `Оферта`;
const description = "Поможем вам найти подходящую - клинику именно для вас";
useSeoMeta({
  title,
  ogTitle: title,
  description,
  ogDescription: description,
});
</script>
